app/controllers/books_controller.rb

  def new
  	  @book = Book.new
  	  @books = Book.all
---
SELECT "books".* FROM "books"

  def index
  	  @user = User.find(current_user.id)
  	  @book = Book.new
  	  @books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def update
  	  book = Book.find(params[:id])
  	  book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "0000"], ["body", "9999"], ["updated_at", "2018-07-31 09:47:41.718085"], ["id", 16]]

  def create
  	  @book = Book.new(book_params)
  	  @book.user_id = current_user.id
  	  if @book.save
  	  	flash[:notice] = "Book was successfully created."
  	 	redirect_to book_path(@book.id)
  	  else
		flash[:notice] = "error"
		@user = User.find(current_user.id)
		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "データベース"], ["body", "たたた"], ["user_id", 1], ["created_at", "2018-07-31 11:06:52.852731"], ["updated_at", "2018-07-31 11:06:52.852731"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def show
	  @book = Book.new
 	  @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]