app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def index
		@users = User.all
		@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "f7a2e85ddfacdfa6f424d49dcc5da67d010983e1396eb7301aded6f580d6"], ["updated_at", "2018-07-31 04:56:37.283409"], ["id", 1]]
---
	def update
		@user = User.find(current_user.id)
		@user.update(user_params)